{
    "version": "https://jsonfeed.org/version/1",
    "title": "艾瑞可erik • All posts by \"phone\" tag • All posts by \"undefined\" categories",
    "description": "一只PHP开发的程序猿，偶尔做做运维、Goland、Python、Java、摄影、画画、写作、顺便睡觉，反正整站都搞过。",
    "home_page_url": "https://erik.xyz",
    "items": [
        {
            "id": "https://erik.xyz/2014/12/08/fen-xi-shi-wei-fire-phone-fa-zhan-zhi-zhao-san-bu-zhou-huo-qi-si-hui-sheng/",
            "url": "https://erik.xyz/2014/12/08/fen-xi-shi-wei-fire-phone-fa-zhan-zhi-zhao-san-bu-zhou-huo-qi-si-hui-sheng/",
            "title": "分析师为Fire Phone发展支招 三步骤或起死回生",
            "date_published": "2014-12-08T15:14:00.000Z",
            "content_html": "<p>12月8日消息，亚马逊集团董事会主席兼CEO杰夫·贝佐斯(Jeff Bezos)表示，亚马逊将会发布更多款的智能手机。外界希望他能从亚马逊Fire Phone的惨痛失败中接受教训并汲取经验。这款手机的失败导致亚马逊从众多手机制造商中脱颖而出的想法变得愈加难以实现。 关于亚马逊的Fire Phone，有两点值得注意。<span id=\"more\"></span></p>\n<p>第一，它仅在美国发售；</p>\n<p>第二，顾客只能购买SIM-free非定制机（这在欧洲市场并不适用）或者是美国电话电报公司 （AT&amp;T）的合约机。如Facebook与HTC联合推出的手机HTC First一样，如果Fire Phone能在网上热销，那一定会震惊许多人。 但Fire Phone有一个优势：亚马逊首页是全球最大的互联网购物窗口之一，Fire Phone有它作为支撑。亚马逊的全部商品分类中可以将Fire Phone放在任意位置，以吸引潜在客户。 如人们所料，亚马逊并未公布Fire Phone相关的销售数据，但有两点可以提示Fire Phone属于“失败产品”的行列。第一点是合约机价格急剧下降（目前两年合约价为99美分），第二点是亚马逊在有关该款手机的成本记录上显示公司减记1.7亿美元。 但杰夫·贝佐斯仍坚持Fire Phone的项目。他表示，在最终确定该项目成功与否之前，“它需要经历几次迭代”。 但笔者对此持不同观点。消费者对商家的信赖需要很长时间才能建立，亚马逊最初冒险尝试Kindle电子书阅读器以及随后的Kindle Fire平板都耗费了好几年时间以取得消费者对亚马逊的信任。但Fire Phone的质量将这份信任迅速消耗，并且没有挽回的可能。 对当今的智能手机制造商而言，市场份额的丢失可以快得出奇，并且是灾难性的。悬崖理论表明一旦消费者的信任不在，那么对手机制造商的支持就会急剧下降，并 且无法挽回。诺基亚，Palm，爱立信（ Ericsson），西门子，飞利浦(Phillips)以及很多其他的公司都曾在此败倒，三星目前似乎也正在接近这个结局。亚马逊在发售Fire Phone前不曾建立起一个强大的智能手机市场，因此它也不存在丢失大份额市场的问题，对它而言，问题在于也许根本无法起步。 </p>\n<p>当Fire Phone2 面世时，它将与Kindle Fire占有相同的市场份额，但会有更多的消费者带着怀疑与谨慎的目光对Fire Phone2进行审视。这并不单单是艰难的第二版的发售，还需要克服一大堆消极思想的包袱。 笔者没有理由质疑贝佐斯坚持开发Fire Phone以期它能进入正轨的行为，因此为了使Fire Phone2 有希望被市场接受，我强调以下三点： </p>\n<p><strong>拓宽运营商网络</strong> 撇开SIM-free非定制机不说，与AT&amp;T制定合约机严重限制了Fire Phone的吸引力。消费者不仅需要一个Fire Phone，还需要与AT&amp;T签订合同，并随着该网络的更新而更新，或者是违约才能使用其他的。这是很多人都关心的问题。大规模销售需要减少消费 者购买的障碍，而与AT&amp;T合作使之独家销售可能会给亚马逊减少一些广告和制造费用，我怀疑AT&amp;T是否帮亚马逊支付了那1.7亿美元的 减记。 Fire Phone 的销售需要全美网络的支持，但这并不意味着它就应该局限于美国境内。世界是相互连通的，美国之外的那些想要Fire Phone的智能手机粉丝们也应该是该手机的潜在客户。亚马逊需要拓展市场，并且在新机发布时（或之后几周内）就让这些地方的客户能够购买到。 </p>\n<p><strong>做到物有所值甚至超值</strong> 物有所值并不仅仅意味着低价。亚马逊不可能把这款手机在美国的价格降至低于99美分，而且购买该手机即享受亚马逊金牌会员1年的优惠也着实诱人。但该款手机并没有兑现它们“做一款好手机”的诺言。点评说这款手机音质差，相机功能不行，以及用户界面不佳。 《福布斯》杂志的Ian Morris指出：“和Fire平板相似，Fire Phone的界面也是一团糟。这确实是个问题，因为如果消费者们对手机性能不满而不愿购买，那么手机很难销售出去。苹果的iPhone之所以畅销就是因为 无论是谁拿起手机，都能够进行操作。我是一位经验丰富的科技行业记者，对我而言，Fire Phone的用户界面的确不怎么样。”‍ 如果消费者们买到的东西毫无用处，那么就这个东西是否便宜对他们而言就没有太大意义了。 亚马逊需要下更大的功夫，让Fire Phone成为一流产品，与其他智能手机相比时能更胜一筹。为了能与现在的知名品牌相媲美，Fire Phone需要做到更好、更快、更流畅，超过其他职能手机如Galaxy S5、iPhone6等。 另外，这款SIM-free非定制机应对得起450美元的价格。然而，亚马逊现在尚未达到这个标准。 </p>\n<p><strong>增强手机的兼容性与实用性</strong> 表面上看来，Fire Phone搭载了安卓系统是一个好消息。安卓系统是消费者们熟知的，它拥有消费者的信任，而且它在业界中也算是一个标志性的操作系统。 当然，这并不是谷歌版本的安卓系统，而是亚马逊版本的。通过改进了Android开放源 项目，亚马逊已经拥有了一套稳定的现代操作系统供其运行。但这个操作系统却没有与Google Play、Google Play Services以及谷歌的首批应用Gmail或谷歌地图等形成连接。然而，这些应用恰恰是诸多消费者十分依赖的。 消费者们已经购买过的那些安卓应用呢？他们需要在亚马逊上重新购买，而不是重新安装即可的。这样的话Fire Phone的App Store上应该拥有所有消费者想要的软件，但事实并不是这样。 亚马逊需要快速而高效地解决这个问题，并且需要在时间和金钱上都付出巨大代价。 如果没有好的主意，软件效用上以及应用兼容方面的缺陷将会使消费者们远离Fire Phone。 </p>\n<p><strong>其他措施</strong> 较差的性能与业界对Fire Phone的差评让亚马逊在智能手机市场举步维艰，很难获得成功。Fire Phone2需要从亚马逊、各个运营商、业内分析师以及消费者那里获得更多的支持。 正如苹果当初发售iPhone的时候一样，Fire Phone的团队应该与多家运营商洽谈，而不是从某一家做起或者打压另一家。他们需要更具战略性，建立更多的合作伙伴及合作关系，并关注现实世界中消费者对于Fire Phone设计改进的反响。 值得庆幸的是，贝佐斯并未放弃。但我想看到的不止是产品的迭代以及配置的优化。要达到预期的销售量，Fire Phone2得下很大功夫。价格、效用以及资金价值方面都需要改进。‍ 本文作者为福布斯专栏作家伊万-斯宾塞。</p>\n",
            "tags": [
                "说说",
                "随笔",
                "phone",
                "手机",
                "新闻"
            ]
        }
    ]
}