{
    "version": "https://jsonfeed.org/version/1",
    "title": "艾瑞可erik • All posts by \"杂谈\" tag • All posts by \"undefined\" categories",
    "description": "一只PHP开发的程序猿，偶尔做做运维、Goland、Python、Java、摄影、画画、写作、顺便睡觉，反正整站都搞过。",
    "home_page_url": "https://erik.xyz",
    "items": [
        {
            "id": "https://erik.xyz/2019/12/03/docker-long/",
            "url": "https://erik.xyz/2019/12/03/docker-long/",
            "title": "容器发展史",
            "date_published": "2019-12-03T15:52:00.000Z",
            "content_html": "<p>一、缘起</p>\n<p>1.1、鸿蒙</p>\n<p>在上古时期，天地初开，一群称之为 “运维” 的人们每天在一种叫作 “服务器” 的神秘盒子中创造属于他们的世界；他们在这个世界中每日劳作，一遍又一遍的写入他们的历史，比如搭建一个 nginx、布署一个 java web 应用…</p>\n<p>大多数人其实并没有那么聪明，他们所 “创造” 的事实上可能是有人已经创造过的东西，他们可能每天都在做着重复的劳动；久而久之，一些人厌倦了、疲惫了…又过了一段时间，一些功力深厚的老前辈创造了一些批量布署工具来帮助人们做一些重复性的劳动，这些工具被起名为 “Asible”、”Chef”、”Puppet” 等等…<br><span id=\"more\"></span><br>而随着时代的发展，”世界” 变得越来越复杂，运维们需要处理的事情越来越多，比如各种网络、磁盘环境的隔离，各种应用服务的高可用…在时代的洪流下，运维们急需要一种简单高效的布署工具，既能有一定的隔离性，又能方便使用，并且最大程度降低重复劳动来提升效率。</p>\n<p>1.2、创世</p>\n<p>在时代洪流的冲击下，一位名为 “Solomon Hykes” 的人异军突起，他创造了一个称之为 Docker 的工具，Docker 被创造以后就以灭世之威向运维们展示了它的强大；一个战斗力只有 5 的运维只需要学习 Docker 很短时间就可以完成资深运维们才能完成的事情，在某些情况下以前需要 1 天才能完成的工作使用 Docker 后几分钟就可以完成；此时运维们已经意识到 “新的时代” 开启了，接下来 Docker 开源并被整个运维界人们使用，Docker 也不断地完善增加各种各样的功能，此后世界正式进入 “容器纪元”。</p>\n<p>二、纷争</p>\n<p>2.1、发展</p>\n<p>随着 Docker 的日益成熟，一些人开始在 Docker 之上创造更加强大的工具，一些人开始在 Docker 之下为其提供更稳定的运行环境…</p>\n<p>其中一个叫作 Google 的公司在 Docker 之上创建了名为 “Kuberentes” 的工具，Kubernetes 操纵 Docker 完成更加复杂的任务；Kubernetes 的出现更加印证了 Docker 的强大，以及 “容器纪元” 的发展正确性。</p>\n<p>2.2、野心</p>\n<p>当然这是一个充满利益的世界，Google 公司创造 Kubernetes 是可以为他们带来利益的，比如他们可以让 Kubernetes 深度适配他们的云平台，以此来增加云平台的销量等；此时 Docker 创始人也成立了一个公司，提供 Docker 的付费服务以及深度定制等；不过值得一提的是 Docker 公司提供的付费服务始终没有 Kubernetes 为 Google 公司带来的利益高，所以在利益的驱使下，Docker 公司开始动起了歪心思: 创造一个 Kubernetes 的替代品，利用用户粘度复制 Kubernetes 的成功，从 Google 嘴里抢下这块蛋糕！此时 Docker 公司只想把蛋糕抢过来，但是他们根本没有在意到暗中一群人创造了一个叫 “rkt” 的东西也在妄图夺走他们嘴里的蛋糕。</p>\n<p>2.3、冲突</p>\n<p>在一段时间的沉默后，Docker 公司又创造了 “Swarm” 这个工具，妄图夺走 Google 公司利用 Kubernetes 赢来的蛋糕；当然，Google 这个公司极其庞大，人数众多，而且在这个社会有很大的影响地位…</p>\n<p>终于，巨人苏醒了，Google 联合了 Redhat、Microsoft、IBM、Intel、Cisco 等公司决定对这个爱动歪脑筋的 Docker 公司进行制裁；当然制裁的手段不能过于暴力，那样会让别人落下把柄，成为别人的笑料，被人所不耻；最总他们决定制订规范，成立组织，明确规定 Docker 的角色，以及它应当拥有的能力，这些规范包括但不限于 CRI、CNI 等；自此之后各大公司宣布他们容器相关的工具只兼容 CRI 等相关标准，无论是 Docker 还是 rkt 等工具，只要实现了这些标准，就可以配合这些容器工具进行使用。</p>\n<p>三、成败</p>\n<p>自此之后，Docker 跌下神坛，各路大神纷纷创造满足 CRI 等规范的工具用来取代 Docker，Docker 丢失了往日一家独大的场面，最终为了顺应时代发展，拆分自己成为模块化组件；这些模块化组件被放置在 mobyproject 中方便其他人重复利用。</p>\n<p>时至今日，虽然 Docker 已经不负以前，但是仍然是容器化首选工具，因为 Docker 是一个完整的产品，它可以提供除了满足 CRI 等标准以外更加方便的功能；但是制裁并非没有结果，Google 公司借此创造了 cri-o 用来满足 CRI 标准，其他公司也相应创建了对应的 CRI 实现；为了进一步分化 Docker 势力，一个叫作 Podman 的工具被创建，它以 cri-o 为基础，兼容大部份 Docker 命令的方式开始抢夺 Dcoker 用户；到目前为止 Podman 已经可以在大部份功能上替代 Docker。</p>\n<p>原文地址：<a href=\"https://mritd.me/2019/06/26/podman-history-of-container\">https://mritd.me/2019/06/26/podman-history-of-container</a></p>\n",
            "tags": [
                "转载",
                "杂谈"
            ]
        },
        {
            "id": "https://erik.xyz/2015/03/22/guo-nei-bu-ru-guo-wai-ma/",
            "url": "https://erik.xyz/2015/03/22/guo-nei-bu-ru-guo-wai-ma/",
            "title": "国内不如国外吗",
            "date_published": "2015-03-22T03:32:00.000Z",
            "content_html": "<p>从成长的时间里我总是听着别人去抱怨中国国情不如美国、瑞士……其他国家，于是我就跟着这种环境的滋养长大了。 中国，国内到底哪点比不上国外，又或者说差别在哪里？这是一连串的的疑问，这答案从哪里找到呢。 在成长中我知道，一个国家的发展离不开底层的人民智慧，创造事物，建设家园，经营贸易……这一切活动的基础条件又是什么？安定繁荣的秩序。对，这就是答案，我恍惚知道了什么…… 翻翻历史祖国的成长得从1840年的前和后来分析。<span id=\"more\"></span> 1840 年以前是什么样子，我们现在的人当然不知道，可考证的只有历代留下的史书、资料。可信度也并不完全大，而这对于大的历史回顾还是相当有用处的。第一次工业 革命开始于18世纪60年代的英国，也就是1760年。1760年的中国正在干什么？1760年的中国正是乾隆二十五年，乾隆刚刚登基，国内正处于康乾盛 世的时段，人人安乐太平。那为什么国内没有进入工业革命的范围或者说没有机器的发明？那这个原因又得把历史往前翻。 中 国四大发明分别起源于春秋、东汉、隋唐、北宋，分别是公元前476年、公元25年、公元581-907年、公元960年算算时间中途有过百年的差距，但是 发明还是有的。在这时间里，社会时有动荡，思想是极为开放的，没有利益与荣耀的纠葛（我猜大概这样）安定而又开阔的思维，有发明是必然的。然而，从隋朝出 现了科举制度，唐朝进一步确立，宋朝完善，明清兴盛。那时科举就是为了当官，当官就是为了光宗耀祖，和如今干一番事业也是差不多的目的。所有人都想着寒窗 苦读，一朝荣耀。除了四书五经还是四书五经，思维就在这几个地方转。发明也就少了，看所有的人都基于这种思维，安定走完一拨又一拨。 落 后也就难免了，没跟上第一次工业革命也很自然。另外当时的清朝是限制航海，排斥外来文化。正式天国自足的安定以及愚昧的四书五经教化，剥夺了开放式的思 维。中国只发明了他，去没有将他们的用途发挥出来。而这期间发明的外流，西方世界不断钻研的改进，使得经济进入一个新的历程。 我 们可以这样说，英国是从1760年开始发展经济的。而中国呢？1840年以前还是最原始的经济，即便是到了1949年中华民国成立，中国的经济依然没有。 而的美国呢，1783年独立，1814年摆脱英国经济控制，大力发展经济，鼓励发明创新。1860年美国经济跃居世界第4。而中国呢，嘉庆裁兵，禁止出 洋。英法联军入京，火烧圆明园，处于动荡中。 那1949年以前，中国正处在第二次世界大战中、紧接着是内战。从第一次工业革命到1949年新中国成立，中国没有过真正的经济发展，也没有什么振兴经济的措施和发明。而此时，美国打发横财、其他国家也是经济萧条靠战争被转移。 而 今，半个世纪多了中国经济在急速复苏，在成长。我们任何人没有资格说中国不好，也没有资格说中国人不文明。那个国家一开始都直接从文明发展过来的吗？那个 国家发展了半个世纪的经济就已经很文明了。我们是比国外的教育、福利、保障比不了，你可以有自己的选择，但是没有资格说自己的祖国。这是事实，也是规则。</p>\n",
            "tags": [
                "杂谈",
                "吐槽"
            ]
        }
    ]
}